# ver1
# ця версія з циклом мені сподобалась більше
# насправді, ця версія розіб'є не тільки 4 цифрове, але мені було цікаво ввести перевірку і цикл, дуже схожий синтаксис на sql
a = int(input("введіть 4 цифри: "))
b = len(str(a)) - 1
if  b is 3: # тут я спочатку написала ==, але згадала, що Ви пропонували is
    print("результат: ")
    while a > 0:
        print(a // 10 ** b)
        a = a % (10 ** b)
        b += - 1
else:
    print("введіть САМЕ!! 4х-значне число")

# ver2
# максимально примітивна версія без циклу і без перевірки, з надією, що користувач шарить і введе саме 4 цифри:)
# ще можна щоразу перепрошивати a, як a = a % 1000, % 100 і тд
a = int(input("введіть 4 цифри: "))
print("результат: ")
print(a // 1000)
print((a % 1000) // 100)
print((a % 100) // 10)
print(a % 10)