# чесались руки додати перевірку на коректність введення числа:)

# ver1
# ця версія з циклом мені сподобалась більше
# насправді, вона розіб'є не тільки 4-цифрове число
# синтаксис дуже подібний до синтаксису sql
a = abs(int(input("введіть 4 цифри: "))) # модуль, бо в завданні вказано ціле, а ціле - це і від'ємне теж (в 2.2 чітко вказано додатне, тому звернула увагу)
len_a = len(str(a))
while len_a > 0:
    print(a // 10 ** (len_a-1))
    a = a % 10 ** (len_a-1) # чомусь не спрацьовує a %= b
    len_a += -1

# ver2
# максимально примітивна версія без циклу і без перевірки, з надією, що користувач свідомий і введе саме 4 цифри:)
a = abs(int(input("введіть 4 цифри: ")))
print(a // 1000)
print((a % 1000) // 100)
print((a % 100) // 10)
print(a % 10)
