# чесались руки додати перевірку на коректність введення числа:)

# ver1
# вибачте, не втрималась і використала цикл, але далі є версія з 4-ма прінтами :)
# насправді, ця версія розіб'є не тільки 4-цифрове число
# модуль, бо в завданні вказано ціле, а ціле - це і від'ємне теж (в 2.2 чітко вказано додатне, тому звернула увагу)
a = abs(int(input("введіть 4 цифри: ")))
len_a = len(str(a))
while len_a > 0:
    print(a // 10 ** (len_a-1))
    a = a % 10 ** (len_a-1) # чомусь не спрацьовує a %= b
    len_a += -1

# ver2
# максимально примітивна версія без циклу, з надією, що користувач свідомий і введе саме 4 цифри:)
# на захист примітивної версії: якщо хтось введе число виду 0001, то попередня версія не справиться, а віддасть без перших нулів
a = abs(int(input("введіть 4 цифри: ")))
print(a // 1000)
print((a % 1000) // 100)
print((a % 100) // 10)
print(a % 10)
